In [3]:
import pandas as pd
import numpy as np

In [4]:
data = {
    'name': ['rob', 'rafiq', 'nina', 'sofia', 'mohan', 'tao', 'elon'],
    'income': [5000, 6000, 4000, 7500, 8000, 7000, 10000000]
}

# create a pandas DataFrame from the dictionary
df = pd.DataFrame(data)

# write the DataFrame to a CSV file
filename = 'income.csv'
df.to_csv(filename, index=False)

In [7]:
df

    name    income
0    rob      5000
1  rafiq      6000
2   nina      4000
3  sofia      7500
4  mohan      8000
5    tao      7000
6   elon  10000000

# remove outlieer using percentile

In [8]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [13]:
df.income.quantile(0.25)

5500.0

In [17]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [21]:
df_no_outier = df[df.income<=percentile_99]
df_no_outier

    name  income
0    rob    5000
1  rafiq    6000
2   nina    4000
3  sofia    7500
4  mohan    8000
5    tao    7000

# we have removed outliers

# filling missing values

In [22]:
df

    name    income
0    rob      5000
1  rafiq      6000
2   nina      4000
3  sofia      7500
4  mohan      8000
5    tao      7000
6   elon  10000000

# remove one of the values

In [23]:
df['income'][3]=np.NaN

C:\Users\HP\AppData\Local\Temp\ipykernel_12700\3054271026.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.NaN

In [24]:
df

    name      income
0    rob      5000.0
1  rafiq      6000.0
2   nina      4000.0
3  sofia         NaN
4  mohan      8000.0
5    tao      7000.0
6   elon  10000000.0

In [26]:
df.income.mean()

1671666.6666666667

# note, should never use mean to fill NaN because of outliers, should use median instead

In [27]:
df.income.median()

6500.0

In [29]:
df_new = df.fillna(df.income.median())
df_new

    name      income
0    rob      5000.0
1  rafiq      6000.0
2   nina      4000.0
3  sofia      6500.0
4  mohan      8000.0
5    tao      7000.0
6   elon  10000000.0

In [33]:
df.income.mode() #note, there is no inbuilt function to find mode

0        4000.0
1        5000.0
2        6000.0
3        7000.0
4        8000.0
5    10000000.0
Name: income, dtype: float64